<?php

namespace Modules\Game\Database\Seeders;

use App\Enums\ActiveStatusEnum;
use Illuminate\Database\Seeder;
use Modules\Game\Entities\Game;

class GameSeeder extends Seeder
{
    public function run()
    {
        Game::insert([
            'name' => 'Katawa Shoujo',
            'short' => 'ks',
            'description' => 'Катава Сёдзё (Katawa Shoujo, かたわ少女, "Калеченые Девы", буквально - "Девушки с ограниченными возможностями") — визуальная новелла жанра бисёдзё производства Four Leaf Studios (4LS), международного проекта, берущего своё начало на доске /a/ анонимной имиджборды 4chan.<br />
Новелла посвящена истории Хисао, молодого человека, которому поставили диагноз "аритмия" и направили в Ямаку, специализированную школу для детей с ограниченными возможностями. Сюжет завязывается вокруг попыток Хисао адаптироваться и смириться со своим новым окружением, а также завести отношения с одной из пяти главных героинь (Эми, Рин, Сидзуне, Лилли или Ханако), каждая из которых страдает какой-либо формой инвалидности (хотя Миша и считается одной из главных героинь, её сюжет - часть рута Сидзуне).<br />
Игра состоит из пролога, содержащего две коротких сцены, первого акта, в котором главный герой может выбрать один из рутов, и трёх дополнительных актов для каждого выбранного рута. Каждая сюжетная линия имеет хорошую и плохую концовку, в некоторых имеются и нейтральные концовки. Выход на определённую концовку зависит от выборов игрока на протяжении всего рута.',
            'short_description' => 'Оригинальный мод игры.<br />Авторы: <b>Four Leaf Studios (4LS)</b><br />Статус: <b>Готова</b><br />Версия: <b>1.3.1</b><br />Руты: <b>5</b><br />Доступно рутов: <b>5 из 5</b>',

            'width' => '800',
            'height' => '600',

            'restriction' => '18',

            'parent_id' => 0,
            'is_active' => ActiveStatusEnum::Active->value,
        ]);

        $this->insertScGame();
    }

    public function insertScGame()
    {
        Game::insert([
            'name' => 'Summer Clover',
            'short' => 'sc',
            'description' => "Фанфик Summer's Clover от Suriko, автора рута Лилли, в виде ВН. В качестве CG используются скетчи от rtil..<br>История рассказывается от лица Мики Миуры и разделяется на два рута — Хисао и Сузу.<br>
            <b>От Suriko:</b> Поздравляю, вы получили рут Мики. Это беспокоило меня на протяжении многих лет, поэтому я достала старый сценарий, который я разработала для данного рута, пока писалась KS и, в конечном итоге, сделала это.",
            'short_description' => 'Фанфик по игре Katawa Shoujo.<br />Авторы: <b>Suriko</b> (Подробнее в титрах игры)<br />Статус: <b>Готова</b><br />Версия: <b>1.0.0</b><br />Руты: <b>2</b><br />Доступно рутов: <b>1 из 2</b><br><em>Рут СУЗУ НЕДОСТУПЕН</em>',

            'width' => '800',
            'height' => '600',

            'restriction' => '18',

            'parent_id' => 1,
            'is_active' => ActiveStatusEnum::Active->value,
        ]);
    }
}
